ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR16DD20def.inc
.equ TCB2_CTRLA = 0x0B20                 ; Control A
.equ TCB2_CTRLB = 0x0B21                 ; Control Register B
.equ TCB2_EVCTRL = 0x0B24                ; Event Control
.equ TCB2_INTCTRL = 0x0B25               ; Interrupt Control
.equ TCB2_INTFLAGS = 0x0B26              ; Interrupt Flags
.equ TCB2_STATUS = 0x0B27                ; Status
.equ TCB2_DBGCTRL = 0x0B28               ; Debug Control
.equ TCB2_TEMP = 0x0B29                  ; Temporary Value
.equ TCB2_CNT = 0x0B2A                   ; Count
.equ TCB2_CNTL = 0x0B2A                  ; Count low byte
.equ TCB2_CNTH = 0x0B2B                  ; Count hi byte
.equ TCB2_CCMP = 0x0B2C                  ; Compare or Capture
.equ TCB2_CCMPL = 0x0B2C                 ; Compare or Capture low byte
.equ TCB2_CCMPH = 0x0B2D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCD0 - Timer Counter D
;*************************************************************************

.equ TCD0_CTRLA = 0x0B80                 ; Control A
.equ TCD0_CTRLB = 0x0B81                 ; Control B
.equ TCD0_CTRLC = 0x0B82                 ; Control C
.equ TCD0_CTRLD = 0x0B83                 ; Control D
.equ TCD0_CTRLE = 0x0B84                 ; Control E
.equ TCD0_EVCTRLA = 0x0B88               ; EVCTRLA
.equ TCD0_EVCTRLB = 0x0B89               ; EVCTRLB
.equ TCD0_INTCTRL = 0x0B8C               ; Interrupt Control
.equ TCD0_INTFLAGS = 0x0B8D              ; Interrupt Flags
.equ TCD0_STATUS = 0x0B8E                ; Status
.equ TCD0_INPUTCTRLA = 0x0B90            ; Input Control A
.equ TCD0_INPUTCTRLB = 0x0B91            ; Input Control B
.equ TCD0_FAULTCTRL = 0x0B92             ; Fault Control
.equ TCD0_DLYCTRL = 0x0B94               ; Delay Control
.equ TCD0_DLYVAL = 0x0B95                ; Delay value
.equ TCD0_DITCTRL = 0x0B98               ; Dither Control A
.equ TCD0_DITVAL = 0x0B99                ; Dither value
.equ TCD0_DBGCTRL = 0x0B9E               ; Debug Control
.equ TCD0_CAPTUREA = 0x0BA2              ; Capture A
.equ TCD0_CAPTUREAL = 0x0BA2             ; Capture A low byte
.equ TCD0_CAPTUREAH = 0x0BA3             ; Capture A hi byte
.equ TCD0_CAPTUREB = 0x0BA4              ; Capture B
.equ TCD0_CAPTUREBL = 0x0BA4             ; Capture B low byte
.equ TCD0_CAPTUREBH = 0x0BA5             ; Capture B hi byte
.equ TCD0_CMPASET = 0x0BA8               ; Compare A Set
.equ TCD0_CMPASETL = 0x0BA8              ; Compare A Set low byte
.equ TCD0_CMPASETH = 0x0BA9              ; Compare A Set hi byte
.equ TCD0_CMPACLR = 0x0BAA               ; Compare A Clear
.equ TCD0_CMPACLRL = 0x0BAA              ; Compare A Clear low byte
.equ TCD0_CMPACLRH = 0x0BAB              ; Compare A Clear hi byte
.equ TCD0_CMPBSET = 0x0BAC               ; Compare B Set
.equ TCD0_CMPBSETL = 0x0BAC              ; Compare B Set low byte
.equ TCD0_CMPBSETH = 0x0BAD              ; Compare B Set hi byte
.equ TCD0_CMPBCLR = 0x0BAE               ; Compare B Clear
.equ TCD0_CMPBCLRL = 0x0BAE              ; Compare B Clear low byte
.equ TCD0_CMPBCLRH = 0x0BAF              ; Compare B Clear hi byte

;*************************************************************************
;** TWI0 - Two-Wire Interface
;*************************************************************************

.equ TWI0_CTRLA = 0x0900                 ; Control A
.equ TWI0_DUALCTRL = 0x0901              ; Dual Mode Control
.equ TWI0_DBGCTRL = 0x0902               ; Debug Control
.equ TWI0_MCTRLA = 0x0903                ; Host Control A
.equ TWI0_MCTRLB = 0x0904                ; Host Control B
.equ TWI0_MSTATUS = 0x0905               ; Host STATUS
.equ TWI0_MBAUD = 0x0906                 ; Host Baud Rate
.equ TWI0_MADDR = 0x0907                 ; Host Address
.equ TWI0_MDATA = 0x0908                 ; Host Data
.equ TWI0_SCTRLA = 0x0909                ; Client Control A
.equ TWI0_SCTRLB = 0x090A                ; Client Control B
.equ TWI0_SSTATUS = 0x090B               ; Client Status
.equ TWI0_SADDR = 0x090C                 ; Client Address
.equ TWI0_SDATA = 0x090D                 ; Client Data
.equ TWI0_SADDRMASK = 0x090E             ; Client Address Mask

;*************************************************************************
;** USART0 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART0_RXDATAL = 0x0800             ; Receive Data Low Byte
.equ USART0_RXDATAH = 0x0801             ; Receive Data High Byte
.equ USART0_TXDATAL = 0x0802             ; Transmit Data Low Byte
.equ USART0_TXDATAH = 0x0803             ; Transmit Data High Byte
.equ USART0_STATUS = 0x0804              ; Status
.equ USART0_CTRLA = 0x0805               ; Control A
.equ USART0_CTRLB = 0x0806               ; Control B
.equ USART0_CTRLC = 0x0807               ; Control C
.equ USART0_BAUD = 0x0808                ; Baud Rate
.equ USART0_BAUDL = 0x0808               ; Baud Rate low byte
.equ USART0_BAUDH = 0x0809               ; Baud Rate hi byte
.equ USART0_CTRLD = 0x080A               ; Control D
.equ USART0_DBGCTRL = 0x080B             ; Debug Control
.equ USART0_EVCTRL = 0x080C              ; Event Control
.equ USART0_TXPLCTRL = 0x080D            ; IRCOM Transmitter Pulse Length Control
.equ USART0_RXPLCTRL = 0x080E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART1 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART1_RXDATAL = 0x0820             ; Receive Data Low Byte
.equ USART1_RXDATAH = 0x0821             ; Receive Data High Byte
.equ USART1_TXDATAL = 0x0822             ; Transmit Data Low Byte
.equ USART1_TXDATAH = 0x0823             ; Transmit Data High Byte
.equ USART1_STATUS = 0x0824              ; Status
.equ USART1_CTRLA = 0x0825               ; Control A
.equ USART1_CTRLB = 0x0826               ; Control B
.equ USART1_CTRLC = 0x0827               ; Control C
.equ USART1_BAUD = 0x0828                ; Baud Rate
.equ USART1_BAUDL = 0x0828               ; Baud Rate low byte
.equ USART1_BAUDH = 0x0829               ; Baud Rate hi byte
.equ USART1_CTRLD = 0x082A               ; Control D
.equ USART1_DBGCTRL = 0x082B             ; Debug Control
.equ USART1_EVCTRL = 0x082C              ; Event Control
.equ USART1_TXPLCTRL = 0x082D            ; IRCOM Transmitter Pulse Length Control
.equ USART1_RXPLCTRL = 0x082E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USERROW - User Row
;*************************************************************************

